faronov/efr32mg1p-zigbee-sensor/app.c
/**
 * @file app.c
 * @brief Application logic for Zigbee BME280 Sensor
 */

#include "sl_component_catalog.h"
#include "zigbee_app_framework_event.h"
#include "app/framework/include/af.h"
// #include "app/framework/plugin/network-steering/network-steering.h" // REMOVED - causes event queue crash
#include "app_sensor.h"
#include "app_config.h"
#include "stack/include/network-formation.h"  // For manual network join
#include "stack/include/security.h"
#include "sl_sleeptimer.h"
#include <stdio.h>
#include <string.h>

#ifdef SL_CATALOG_SIMPLE_BUTTON_PRESENT
#include "sl_simple_button_instances.h"
#endif

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
#include "sl_simple_led_instances.h"
#endif

// LED blink event for network joining indication
static sl_zigbee_event_t led_blink_event;
static bool led_blink_active = false;

// LED off timer - turn off LED after network join confirmation
static sl_zigbee_event_t led_off_event;

static uint8_t join_attempt_count = 0;
#define JOIN_SCAN_DURATION 3  // Active scan duration (Zigbee scan exponent)

// Button action flags (set by ISR, cleared by main loop)
// Using volatile because these are accessed from both ISR and main context
static volatile bool button_short_press_pending = false;
static volatile bool button_long_press_pending = false;

// Button press duration tracking
static uint32_t button_press_start_tick = 0;
static bool button_pressed = false;
#define LONG_PRESS_THRESHOLD_MS 5000  // 5 seconds for long press (leave/rejoin network)

// Optimized rejoin state machine (TEMPORARILY DISABLED - event queue issue)
// typedef enum {
//   REJOIN_STATE_IDLE,
//   REJOIN_STATE_CURRENT_CHANNEL,
//   REJOIN_STATE_ALL_CHANNELS,
//   REJOIN_STATE_DONE
// } RejoinState_t;

// static sl_zigbee_event_t rejoin_retry_event;
// static RejoinState_t rejoin_state = REJOIN_STATE_IDLE;
// static uint8_t saved_channel = 0;

// Rejoin timeout configuration
#define REJOIN_CURRENT_CHANNEL_TIMEOUT_MS  500   // Wait 500ms before trying all channels
#define REJOIN_FULL_SCAN_TIMEOUT_MS        5000  // Wait 5s for full scan to complete

// Channel mask helper macro
#ifndef BIT32
#define BIT32(n) (((uint32_t)1) << (n))
#endif

#if defined(__GNUC__)
#define APP_UNUSED __attribute__((unused))
#else
#define APP_UNUSED
#endif

#ifndef APP_DEBUG_DIAG_ALWAYS
#define APP_DEBUG_DIAG_ALWAYS 0
#endif
#define APP_DEBUG_PRINTF(...) printf(__VA_ARGS__)

static void handle_short_press(void);

void app_debug_sanity(void)
{
  APP_DEBUG_PRINTF("app_debug_sanity\n");
}

void app_debug_trigger_short_press(void)
{
  APP_DEBUG_PRINTF("app_debug_trigger_short_press\n");
  handle_short_press();
}

// Zigbee 3.0 channels (11-26)
#define ZIGBEE_CHANNELS_MASK 0x07FFF800

// Single-channel network join state (Series 1 workaround for event queue limitation)
// Try channels in order of popularity: 15, 20, 25, 11, 14, 19, 24, 26, 12, 13, 16, 17, 18, 21, 22, 23
static const uint8_t channel_scan_order[] = {15, 20, 25, 11, 14, 19, 24, 26, 12, 13, 16, 17, 18, 21, 22, 23};
static uint8_t current_channel_index = 0;  // Index into channel_scan_order array
static bool network_join_in_progress = false;
static bool join_scan_in_progress = false;
static bool join_network_found = false;
static EmberZigbeeNetwork join_candidate;
static bool af_init_seen = false;
static bool af_init_reported = false;
static bool join_pending = false;
static bool join_security_configured = false;

#ifndef EMBER_ENCRYPTION_KEY_SIZE
#define EMBER_ENCRYPTION_KEY_SIZE 16
#endif

static const uint8_t zigbee_alliance_key[EMBER_ENCRYPTION_KEY_SIZE] = {
  0x5A, 0x69, 0x67, 0x42, 0x65, 0x65, 0x41, 0x6C,
  0x6C, 0x69, 0x61, 0x6E, 0x63, 0x65, 0x30, 0x39
};

// Forward declarations
static void led_blink_event_handler(sl_zigbee_event_t *event);
static void led_off_event_handler(sl_zigbee_event_t *event);
static void rejoin_retry_event_handler(sl_zigbee_event_t *event) APP_UNUSED;
static void start_optimized_rejoin(void) APP_UNUSED;
static void handle_short_press(void);
static void handle_long_press(void);
static EmberStatus start_join_scan(void);
static void try_next_channel(void);
static void configure_join_security(void);

/**
 * @brief Zigbee application init callback
 *
 * Called when the Zigbee stack has completed initialization.
 * This is where we initialize application components.
 */
void emberAfInitCallback(void)
{
  if (af_init_seen) {
    APP_DEBUG_PRINTF("AF init callback (duplicate)\n");
    return;
  }
  APP_DEBUG_PRINTF("AF init callback\n");
  af_init_seen = true;
  emberAfCorePrintln("Zigbee BME280 Sensor Application");
  emberAfCorePrintln("Silicon Labs EFR32MG1P + Bosch BME280");
  emberAfCorePrintln("Press BTN0 to join network or trigger sensor reading");

  // Initialize LED events
  sl_zigbee_event_init(&led_blink_event, led_blink_event_handler);
  sl_zigbee_event_init(&led_off_event, led_off_event_handler);

  // Button handling uses emberAfTickCallback() to check flags - no events needed

  // Initialize optimized rejoin event (TEMPORARILY DISABLED - event queue issue)
  // sl_zigbee_event_init(&rejoin_retry_event, rejoin_retry_event_handler);

  // Initialize configuration from NVM
  app_config_init();

  // TEMPORARILY DISABLE sensor to reduce event usage (event queue issue)
  // Initialize BME280 sensor
  // if (!app_sensor_init()) {
  //   emberAfCorePrintln("ERROR: Sensor initialization failed!");
  // #ifdef SL_CATALOG_SIMPLE_LED_PRESENT
  //   // Rapid blink on error
  //   for (int i = 0; i < 10; i++) {
  //     sl_led_toggle(&sl_led_led0);
  //     sl_sleeptimer_delay_millisecond(100);
  //   }
  // #endif
  // }
  emberAfCorePrintln("Sensor DISABLED for testing - event queue issue");
}

void app_debug_force_af_init(void)
{
#if defined(APP_DEBUG_FORCE_AF_INIT) && (APP_DEBUG_FORCE_AF_INIT != 0)
  if (!af_init_seen) {
    APP_DEBUG_PRINTF("AF init forced (debug)\n");
    emberAfInitCallback();
  }
#endif
}

/**
 * @brief Network join success callback
 *
 * Called when the device successfully joins a Zigbee network.
 */
void emberAfStackStatusCallback(EmberStatus status)
{
  APP_DEBUG_PRINTF("Stack status: 0x%02x\n", status);
  if (status == EMBER_NETWORK_UP) {
    emberAfCorePrintln("Network joined successfully");

    // Reset join attempt counter and scan state on success
    join_attempt_count = 0;
    current_channel_index = 0;
    network_join_in_progress = false;
    join_scan_in_progress = false;
    join_network_found = false;

    // Cancel any pending rejoin attempts - network is up (TEMPORARILY DISABLED)
    // rejoin_state = REJOIN_STATE_DONE;
    // sl_zigbee_event_set_inactive(&rejoin_retry_event);

    // Stop LED blinking
    led_blink_active = false;
    sl_zigbee_event_set_inactive(&led_blink_event);

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Turn LED on solid to indicate network is up
    sl_led_turn_on(&sl_led_led0);

    // Schedule LED to turn off after 3 seconds to save power
    sl_zigbee_event_set_delay_ms(&led_off_event, 3000);
#endif

    // Sensor DISABLED for testing (event queue issue)
    // Perform initial sensor reading after joining
    // app_sensor_update();

    // Restart periodic sensor updates
    // app_sensor_start_periodic_updates();

    // Note: Binding is handled by coordinator (Zigbee2MQTT/ZHA/deCONZ)
    // No device-side binding code needed - see BINDING_GUIDE.md

  } else if (status == EMBER_NETWORK_DOWN) {
    emberAfCorePrintln("Network down - will attempt optimized rejoin");

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Turn LED off when network is down
    sl_led_turn_off(&sl_led_led0);
    // Cancel any pending LED off event
    sl_zigbee_event_set_inactive(&led_off_event);
#endif

    // Sensor timer will automatically stop reading when event handler checks network state
    // Device will use minimal power while waiting for network

    // Optimized rejoin TEMPORARILY DISABLED - event queue issue
    // emberAfCorePrintln("Scheduling optimized rejoin in 100ms...");
    // rejoin_state = REJOIN_STATE_IDLE;
    // sl_zigbee_event_set_delay_ms(&rejoin_retry_event, 100);
  }
}

/**
 * @brief Button press callback
 *
 * Called when a button is pressed or released on the board.
 * Detects short press (<5s) vs long press (>=5s).
 *
 * CRITICAL: This runs in ISR context (GPIO_ODD_IRQn)!
 * CANNOT call ANY functions that interact with Zigbee stack!
 * CANNOT call emberAfCorePrintln()!
 * CANNOT call sl_zigbee_event_set_active()!
 *
 * Only allowed: read hardware, do math, set volatile flags
 * The button_poll_event running in main context will check these flags
 */
#ifdef SL_CATALOG_SIMPLE_BUTTON_PRESENT
void sl_button_on_change(const sl_button_t *handle)
{
  if (handle == &sl_button_btn0) {
    if (sl_button_get_state(handle) == SL_SIMPLE_BUTTON_PRESSED) {
      // Button pressed - record start time
      button_press_start_tick = sl_sleeptimer_get_tick_count();
      button_pressed = true;
    } else {
      // Button released - check duration
      if (button_pressed) {
        uint32_t duration_ticks = sl_sleeptimer_get_tick_count() - button_press_start_tick;
        uint32_t duration_ms = sl_sleeptimer_tick_to_ms(duration_ticks);

        // Set flags for main context to poll
        // These will be checked by button_poll_event_handler()
        if (duration_ms >= LONG_PRESS_THRESHOLD_MS) {
          button_long_press_pending = true;
        } else {
          button_short_press_pending = true;
        }

        button_pressed = false;
      }
    }
  }
}
#endif

/**
 * @brief LED blink event handler
 *
 * Blinks the LED while joining network.
 */
static void led_blink_event_handler(sl_zigbee_event_t *event)
{
#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
  if (led_blink_active) {
    sl_led_toggle(&sl_led_led0);
    // Blink every 500ms
    sl_zigbee_event_set_delay_ms(&led_blink_event, 500);
  }
#endif
}

/**
 * @brief LED off event handler
 *
 * Turns off the LED after network join confirmation to save power.
 */
static void led_off_event_handler(sl_zigbee_event_t *event)
{
#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
  sl_led_turn_off(&sl_led_led0);
  emberAfCorePrintln("LED turned off to save power");
#endif
}

/**
 * @brief Main tick callback - runs every main loop iteration
 *
 * This is called from main context and is perfect for checking button flags
 * set by the button ISR. No event scheduling needed!
 */
void emberAfTickCallback(void)
{
  static uint32_t last_heartbeat_tick = 0;
  uint32_t now = sl_sleeptimer_get_tick_count();

  if (!af_init_reported && af_init_seen) {
    af_init_reported = true;
    APP_DEBUG_PRINTF("AF init seen (tick)\n");
  }

  if (join_pending && af_init_seen && !network_join_in_progress) {
    join_pending = false;
    APP_DEBUG_PRINTF("Join: deferred request starting\n");
    handle_short_press();
  }

  if (last_heartbeat_tick == 0 ||
      sl_sleeptimer_tick_to_ms(now - last_heartbeat_tick) >= 5000) {
    last_heartbeat_tick = now;
    APP_DEBUG_PRINTF("Heartbeat: net=%d join_in_progress=%d\n",
                     emberAfNetworkState(),
                     network_join_in_progress);
    if (APP_DEBUG_DIAG_ALWAYS) {
      EmberNetworkStatus state = emberAfNetworkState();
      APP_DEBUG_PRINTF("Zigbee state=%d, joined=%d\n",
                       state,
                       (state == EMBER_JOINED_NETWORK));
    }
  }

  // Check for short press
  if (button_short_press_pending) {
    button_short_press_pending = false;  // Clear flag
    APP_DEBUG_PRINTF("Button short press\n");
    emberAfCorePrintln("Button: Short press detected (tick callback)");
    handle_short_press();
  }

  // Check for long press
  if (button_long_press_pending) {
    button_long_press_pending = false;  // Clear flag
    APP_DEBUG_PRINTF("Button long press\n");
    emberAfCorePrintln("Button: Long press detected (tick callback)");
    handle_long_press();
  }
}

/**
 * @brief Optimized rejoin retry event handler
 *
 * Manages the rejoin state machine:
 * 1. Try current channel first (fast path)
 * 2. If timeout, try all channels (fallback)
 */
static void rejoin_retry_event_handler(sl_zigbee_event_t *event)
{
  // TEMPORARILY DISABLED - event queue issue
  // Optimized rejoin functionality removed to reduce event usage
  (void)event;  // Unused parameter
}

/**
 * @brief Start optimized rejoin - try current channel first
 *
 * Optimization: Attempt rejoin on previously-used channel first for fast
 * reconnection (~138ms vs ~2.2s). Falls back to full channel scan after
 * timeout if current channel doesn't respond.
 *
 * Benefits:
 * - 7x faster rejoin when successful (typical case)
 * - ~85% power savings for successful rejoins
 * - Graceful fallback to full scan if network changed
 */
static void start_optimized_rejoin(void)
{
  // TEMPORARILY DISABLED - event queue issue
  // Optimized rejoin functionality removed to reduce event usage
}

/**
 * @brief Try next channel in the scan sequence
 *
 * Move to next channel and attempt join. If all channels exhausted,
 * report failure and stop scanning.
 */
static void try_next_channel(void)
{
  const uint8_t total_channels = sizeof(channel_scan_order) / sizeof(channel_scan_order[0]);

  if (join_scan_in_progress) {
    APP_DEBUG_PRINTF("Join: scan already in progress\n");
    return;
  }

  // Move to next channel
  current_channel_index++;

  while (current_channel_index < total_channels) {
    EmberStatus status = start_join_scan();
    if (status == EMBER_SUCCESS) {
      return;
    }
    APP_DEBUG_PRINTF("Join: scan start failed on ch %d status 0x%02x\n",
                     channel_scan_order[current_channel_index],
                     status);
    current_channel_index++;
  }

  if (current_channel_index >= total_channels) {
    // Exhausted all channels - give up
    emberAfCorePrintln("All channels scanned - no network found");
    network_join_in_progress = false;
    join_scan_in_progress = false;
    join_network_found = false;
    current_channel_index = 0;
    join_attempt_count++;

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Stop LED blinking
    led_blink_active = false;
    sl_zigbee_event_set_inactive(&led_blink_event);
    sl_led_turn_off(&sl_led_led0);
#endif
  }
}

/**
 * @brief Start an active scan on the current channel
 *
 * Series 1 Workaround: Scans ONE channel at a time instead of all 16 channels
 * simultaneously. This prevents event queue overflow on Series 1 chips.
 */
static EmberStatus start_join_scan(void)
{
  const uint8_t total_channels = sizeof(channel_scan_order) / sizeof(channel_scan_order[0]);

  if (current_channel_index >= total_channels) {
    emberAfCorePrintln("ERROR: Invalid channel index %d", current_channel_index);
    return EMBER_INVALID_CALL;
  }

  uint8_t channel_to_scan = channel_scan_order[current_channel_index];
  uint32_t single_channel_mask = BIT32(channel_to_scan);

  emberAfCorePrintln("Active scan channel %d (%d of %d)...",
                     channel_to_scan,
                     current_channel_index + 1,
                     total_channels);
  APP_DEBUG_PRINTF("Join: start scan channel %d mask 0x%08lx\n",
                   channel_to_scan,
                   (unsigned long)single_channel_mask);

  join_scan_in_progress = true;
  join_network_found = false;
  memset(&join_candidate, 0, sizeof(join_candidate));

  // Scan ONLY this one channel - uses minimal events
  EmberStatus status = emberStartScan(EMBER_ACTIVE_SCAN, single_channel_mask, JOIN_SCAN_DURATION);
  APP_DEBUG_PRINTF("Join: emberStartScan -> 0x%02x\n", status);

  if (status != EMBER_SUCCESS) {
    emberAfCorePrintln("Failed to start scan on channel %d: 0x%x", channel_to_scan, status);
    join_scan_in_progress = false;
  }

  return status;
}

/**
 * @brief Scan result callback (called for each network found)
 */
void emberAfNetworkFoundCallback(EmberZigbeeNetwork *networkFound, uint8_t lqi, int8_t rssi)
{
  if (!network_join_in_progress || networkFound == NULL) {
    return;
  }

  if (!networkFound->allowingJoin) {
    APP_DEBUG_PRINTF("Join: network ch %d pan 0x%04x not open (lqi=%u rssi=%d)\n",
                     networkFound->channel,
                     networkFound->panId,
                     lqi,
                     rssi);
    return;
  }

  if (!join_network_found) {
    join_network_found = true;
    join_candidate = *networkFound;
    APP_DEBUG_PRINTF("Join: found network ch %d pan 0x%04x (lqi=%u rssi=%d)\n",
                     join_candidate.channel,
                     join_candidate.panId,
                     lqi,
                     rssi);
  }
}

/**
 * @brief Scan completion callback
 */
void emberAfScanCompleteCallback(uint8_t channel, EmberStatus status)
{
  if (!network_join_in_progress) {
    return;
  }

  join_scan_in_progress = false;
  APP_DEBUG_PRINTF("Join: scan complete ch=%u status=0x%02x found=%d\n",
                   channel,
                   status,
                   join_network_found ? 1 : 0);

  if (join_network_found) {
    EmberNetworkParameters params;
    memset(&params, 0, sizeof(params));
    memcpy(params.extendedPanId, join_candidate.extendedPanId, EXTENDED_PAN_ID_SIZE);
    params.panId = join_candidate.panId;
    params.radioChannel = join_candidate.channel;
    params.radioTxPower = emberGetRadioPower();
    params.joinMethod = EMBER_USE_MAC_ASSOCIATION;
    params.nwkManagerId = 0x0000;
    params.nwkUpdateId = join_candidate.nwkUpdateId;
    params.channels = BIT32(join_candidate.channel);

    EmberStatus join_status = emberJoinNetwork(EMBER_END_DEVICE, &params);
    APP_DEBUG_PRINTF("Join: emberJoinNetwork -> 0x%02x\n", join_status);
    if (join_status != EMBER_SUCCESS) {
      emberAfCorePrintln("Join failed to start: 0x%x", join_status);
      join_network_found = false;
      try_next_channel();
    }
    return;
  }

  // No joinable network on this channel - try next channel
  try_next_channel();
}

/**
 * @brief Handle short button press (<5 seconds)
 *
 * Short press triggers immediate sensor read and report.
 * If not joined to network, starts network joining.
 */
static void handle_short_press(void)
{
  EmberNetworkStatus network_state = emberAfNetworkState();

  if (network_state == EMBER_JOINED_NETWORK) {
    // Already on network - trigger immediate sensor reading
    emberAfCorePrintln("Triggering immediate sensor read...");
    app_sensor_update();

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Flash LED briefly to indicate sensor read
    sl_led_turn_on(&sl_led_led0);
    sl_sleeptimer_delay_millisecond(200);
    sl_led_turn_off(&sl_led_led0);
#endif

  } else {
    if (!af_init_seen) {
      APP_DEBUG_PRINTF("Join: AF init not ready - deferring\n");
      join_pending = true;
      return;
    }
    if (network_join_in_progress) {
      emberAfCorePrintln("Join already in progress - ignoring button press");
      APP_DEBUG_PRINTF("Join: already in progress\n");
      return;
    }

    // Not on network - start manual network join
    emberAfCorePrintln("Not joined - starting network join (attempt %d)...",
                       join_attempt_count + 1);
    APP_DEBUG_PRINTF("Join: attempt %d\n", join_attempt_count + 1);
    configure_join_security();

    // Reset to start of channel list
    current_channel_index = 0;
    join_scan_in_progress = false;
    join_network_found = false;
    network_join_in_progress = true;

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Start LED blinking to indicate joining
    led_blink_active = true;
    sl_zigbee_event_set_active(&led_blink_event);
#endif

    // Start manual network join (no longer using network steering plugin)
    EmberStatus join_status = start_join_scan();

    if (join_status != EMBER_SUCCESS) {
      emberAfCorePrintln("Join failed to start: 0x%x", join_status);
      if (join_status == EMBER_INVALID_CALL) {
        emberAfCorePrintln("Join aborted: stack not ready");
        network_join_in_progress = false;
        join_scan_in_progress = false;
        join_network_found = false;
      } else {
        try_next_channel();
      }

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
      // Stop LED blinking on failure
      if (!network_join_in_progress) {
        led_blink_active = false;
        sl_zigbee_event_set_inactive(&led_blink_event);
        sl_led_turn_off(&sl_led_led0);
      }
#endif
    }
  }
}

static void configure_join_security(void)
{
  if (join_security_configured) {
    return;
  }

#if defined(EMBER_HAVE_PRECONFIGURED_KEY) && defined(EMBER_TRUST_CENTER_GLOBAL_LINK_KEY)
  EmberInitialSecurityState state;
  memset(&state, 0, sizeof(state));
  memcpy(state.preconfiguredKey.contents, zigbee_alliance_key, EMBER_ENCRYPTION_KEY_SIZE);
  state.bitmask = (EMBER_HAVE_PRECONFIGURED_KEY
                   | EMBER_REQUIRE_ENCRYPTED_KEY
                   | EMBER_TRUST_CENTER_GLOBAL_LINK_KEY);

  EmberStatus st = emberSetInitialSecurityState(&state);
  APP_DEBUG_PRINTF("Join: set security state -> 0x%02x\n", st);
  if (st == EMBER_SUCCESS) {
    join_security_configured = true;
  }
#else
  APP_DEBUG_PRINTF("Join: security macros missing - skipping key setup\n");
#endif
}

/**
 * @brief Handle long button press (>=5 seconds)
 *
 * Long press causes the device to leave the current network
 * and immediately attempt to rejoin (useful for moving to a new coordinator).
 */
static void handle_long_press(void)
{
  EmberNetworkStatus network_state = emberAfNetworkState();

  if (network_state == EMBER_JOINED_NETWORK) {
    emberAfCorePrintln("Leaving network and rejoining...");

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Flash LED rapidly to indicate leave operation
    for (int i = 0; i < 5; i++) {
      sl_led_toggle(&sl_led_led0);
      sl_sleeptimer_delay_millisecond(100);
    }
#endif

    // Leave the network
    EmberStatus leave_status = emberLeaveNetwork();
    if (leave_status == EMBER_SUCCESS) {
      emberAfCorePrintln("Left network successfully");

      // Reset join attempt counter and channel index for new join
      join_attempt_count = 0;
      current_channel_index = 0;
      join_scan_in_progress = false;
      join_network_found = false;
      network_join_in_progress = true;

      // Small delay to ensure leave completes
      sl_sleeptimer_delay_millisecond(500);

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
      // Start LED blinking to indicate joining
      led_blink_active = true;
      sl_zigbee_event_set_active(&led_blink_event);
#endif

      // Start manual network join to rejoin (no longer using network steering plugin)
      EmberStatus join_status = start_join_scan();
      if (join_status != EMBER_SUCCESS) {
        emberAfCorePrintln("Failed to start rejoin: 0x%x", join_status);
#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
        if (!network_join_in_progress) {
          led_blink_active = false;
          sl_zigbee_event_set_inactive(&led_blink_event);
          sl_led_turn_off(&sl_led_led0);
        }
#endif
      }
    } else {
      emberAfCorePrintln("Failed to leave network: 0x%x", leave_status);
    }
  } else {
    emberAfCorePrintln("Not joined to network - long press ignored");
  }
}
